In [2]:
import mysql.connector as connection
import pandas as pd

In [4]:
#pip install mysql

In [7]:
sql = "SELECT * FROM classicmodels.orders;"

In [5]:
db = connection.connect(host="localhost", database="classicmodels", user="root", passwd="demopass01", use_pure=True)

In [8]:
df = pd.read_sql(sql, db)

In [9]:
df.head()

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,None,181
3,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,None,121
4,10104,2003-01-31,2003-02-09,2003-02-01,Shipped,None,141

In [10]:
df.to_excel("mysql_date.xlsx", index=False)

In [11]:
db.close()